Repository: openstack/zaqar
Catalog: zaqar/locale/*/LC_MESSAGES/zaqar.po
Languages: pt_br

source: Terminating
pt_br: Finalizando

source: Stage %(stage)s does not implement %(method)s
pt_br: O estágio %(stage)s não implementa o método %(method)s

source: Method %s not found in any of the registered stages
pt_br: O método %s não foi encontrado em nenhum dos estágios registrados

source: Malformed hexadecimal UUID.
pt_br: UUID hexadecimal inválido.

source: X-PROJECT-ID cannot be an empty string. Specify the right header X-PROJECT-ID and retry.
pt_br: X-PROJECT-ID não pode ser uma string vazia. Especifique o cabeçalho X-PROJECT-ID e tente novemente.

source: The header X-PROJECT-ID was missing
pt_br: Está faltando o cabeçalho X-PROJECT-ID

source: Invalid queue identification
pt_br: Identificação de fila inválida

source: The format of the submitted queue name or project id is not valid.
pt_br: O formato do nome da fila submetida ou o identificador do projeto não é válido.

source: Message objects do not support addition.
pt_br: Objetos mensagem não suportam adição.

source: Message objects do not support str() because they may contain non-ascii characters. Please use unicode() or translate() instead.
pt_br: Objetos mensagem não suportam str() pois podem conter carácteres não-ascii. Use unicode() ou translate().

source: Unable to acquire lock on `%(filename)s` due to %(exception)s
pt_br: Não foi possível bloquear o arquivo ` %(filename)s` devido a %(exception)s

source: Deprecated: %s
pt_br: Obsoleto: %s

source: Error loading logging config %(log_config)s: %(err_msg)s
pt_br: Erro ao carregar configuração %(log_config)s: %(err_msg)s

source: syslog facility must be one of: %s
pt_br: O recurso de syslog deve ser um dos seguintes: %s

source: Fatal call to deprecated config: %(msg)s
pt_br: Chamada fatal de configuração obsoleta: %(msg)s

source: Unrecognized value '%(val)s', acceptable values are: %(acceptable)s
pt_br: Valor não reconhecido '%(val)s', os valores aceitáveis são: %(acceptable)s

source: Invalid unit system: "%s"
pt_br: Unidade inválida do sistema: "%s"

source: Invalid string format: %s
pt_br: Formato de string inválido: %s

source: Stage %(stage)d could not be imported: %(ex)s
pt_br: O estágio %(stage)d não pode ser importado: %(ex)s

source: The mongodb driver requires mongodb>=2.2, %s found
pt_br: O driver do mongodb requer mongodb>=2.2, %s encontrado

source: %(attempts)d attempt(s) required to post %(num_messages)d messages to queue "%(queue)s" under project %(project)s
pt_br: %(attempts)d tentativa(s) necessária(s) para enviar %(num_messages)d mensagens para a fila "%(queue)s" do projeto %(project)s

source: First attempt failed while adding messages to queue "%(queue)s" under project %(project)s
pt_br: Primeira tentativa falhou durante a adição de mensagens à fila "%(queue)s" do projeto %(project)s

source: Exceeded maximum retry duration for queue "%(queue)s" under project %(project)s
pt_br: Excedido o tempo máximo de tentativas para a fila "%(queue)s" do projeto %(project)s

source: Hit maximum number of attempts (%(max)s) for queue "%(queue)s" under project %(project)s
pt_br: Excedido o número máximo de tentativas (%(max)s) para a fila "%(queue)s" do projeto %(project)s

source: Failed to increment the message counter for queue %(name)s and project %(project)s
pt_br: Falha ao incrementar o contador de mensagens para a fila %(name)s e projeto %(project)s

source: Caught AutoReconnect, retrying the call to {0}
pt_br: Exceção AutoReconnect capturada, tentando chamar {0} novamente

source: Caught AutoReconnect, maximum attempts to {0} exceeded.
pt_br: Exceção AutoReconnect capturada, número máximo de tentativas para {0} excedido.

source: Malformed Redis URI
pt_br: URI do Redis mal-formada

source: Invalid scheme in Redis URI
pt_br: Esquema inválido na URI do Redis

source: Missing host name in Redis URI
pt_br: Faltando nome do host na URI do Redis

source: Missing path in Redis URI
pt_br: Faltando caminho na URI do Redis

source: Project ids may not be more than {0} characters long.
pt_br: Identificadores de projeto não devem ter mais de {0} carácteres.

source: Queue names may not be more than {0} characters long.
pt_br: Nomes de filas não devem ter mais de {0} carácteres.

source: Queue names may only contain ASCII letters, digits, underscores, and dashes.
pt_br: O nome de uma fila deve conter apenas letras ASCII, números, subtraços e traços.

source: Limit must be at least 1 and no greater than {0}.
pt_br: O limite deve ser no mínimo 1 e não deve ser superior a {0}.

source: Queue metadata is too large. Max size: {0}
pt_br: Os métadados da fila são muito grandes. Tamanho máximo: {0}

source: No messages to enqueu.
pt_br: Não foi possível adicionar mensagens à fila.

source: Message collection size is too large. Max size {0}
pt_br: O tamanho da coleção de mensagens é muito grande. O tamnho máximo é {0}

source: The TTL for a message may not exceed {0} seconds, and must be at least {1} seconds long.
pt_br: O tempo de vida de uma mensagem não pode exceder {0} segundos e não deve ser menor que {1} segundos.

source: Limit must be at least 1 and may not be greater than {0}.
pt_br: O limite deve ser de no mínimo 1 e não deve exceder {0}.

source: The grace for a claim may not exceed {0} seconds, and must be at least {1} seconds long.
pt_br: O prazo de carência para um pedido não deve exceder {0} segundos e não deve ser menor que {1} segundo.

source: The TTL for a claim may not exceed {0} seconds, and must be at least {1} seconds long.
pt_br: O tempo de vida de um pedido não pode exceder {0} segundos e não deve ser menor que {1} segundos.

source: Serving on host %(bind)s:%(port)s
pt_br: Servindo em %(bind)s:%(port)s

source: Service temporarily unavailable
pt_br: Serviço temporariamente indisponível

source: Please try again in a few seconds.
pt_br: Tente novamente em alguns segundos.

source: Invalid API request
pt_br: Requisição inválida de API

source: Invalid request body
pt_br: Corpo da requisição inválido

source: Document type not supported.
pt_br: Tipo de documento não suportado.

source: Request body can not be empty
pt_br: O corpo da requisição não pode ser vazio

source: Request body could not be parsed.
pt_br: Não foi possível analisar o corpo da requisição.

source: JSON contains integer that is too large.
pt_br: JSON possui um numero inteiro muito grande.

source: Request body could not be read.
pt_br: O corpo da requisição não pode ser lido.

source: Missing "{name}" field.
pt_br: Faltando o campo "{name}".

source: The value of the "{name}" field must be a {vtype}.
pt_br: O valor do campo "{name}" deve ser do tipo {vtype}.

source: Claim could not be created.
pt_br: Não foi possível criar o pedido.

source: Claim could not be queried.
pt_br: Não foi possível consultar o pedido.

source: Claim could not be updated.
pt_br: Não foi possível atualizar o pedido.

source: Claim could not be deleted.
pt_br: Não foi possível excluir o pedido.

source: Message could not be retrieved.
pt_br: Não foi possível recuperar a mensagem.

source: Messages could not be listed.
pt_br: Não foi possível listar a mensagem.

source: No messages could be enqueued.
pt_br: Nenhuma mensagem pode ser adicionada à fila.

source: Messages could not be enqueued.
pt_br: Não foi possível adicionar mensagens à fila.

source: Messages could not be deleted.
pt_br: Não foi possível excluir as mensagens.

source: Unable to delete
pt_br: Impossível excluir

source: Message could not be deleted.
pt_br: A mensagem não pode ser excluída.

source: Queue metadata could not be retrieved.
pt_br: Não foi possível obter os metadados da fila.

source: Metadata could not be updated.
pt_br: Não foi possível atualizar os metadados.

source: Queue could not be created.
pt_br: Não foi possível criar a fila.

source: Queue could not be deleted.
pt_br: Não foi possível excluir a fila.

source: Queues could not be listed.
pt_br: Não foi possível listar as filas.

source: Queue stats could not be read.
pt_br: Não foi possível ler as estatísticas da fila.

source: Unable to create
pt_br: Não foi possível criar

source: No messages were found in the request body.
pt_br: Nenhuma mensagem foi encontrada no corpo da requisição.

source: Messages could not be popped.
pt_br: Mensagens não puderam ser exibidas.
